# IsBuiltInGroup Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils..::..IsBuiltInGroup Method
ParameterUtils Class See Also
---
Checks whether a ForgeTypeId identifies a built-in parameter group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static bool IsBuiltInGroup(
	ForgeTypeId groupTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsBuiltInGroup ( _
	groupTypeId As ForgeTypeId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsBuiltInGroup(
	ForgeTypeId^ groupTypeId
)
```

# ### Parameters
groupTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The identifier to check.
# ### Return Value
True if the ForgeTypeId identifies a built-in parameter group, false otherwise.
# Remarks
A ForgeTypeId identifies a built-in parameter group if it corresponds to a valid BuiltInParameterGroup value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace